[
{"Caption": "Ideal work-place!", "Testimonial": "Great place to work and evolve, lots of great opportunities to learn new things and up-skill yourself. I've had great experiences with my past managers and with my colleagues.", "Mark": "5.0"},
{"Caption": "Great company", "Testimonial": "Worked as a contractor on multiple contracts for 3 years 1/2 as an account manager.", "Mark": "5.0"},
{"Caption": "Competitive very Hardcore Sales Culture Environment", "Testimonial": "It was a great priviledge to have worked at Google. I really value my time there. However, the culture is only based on sales and that demoralizes the workforce to some extent and the management is very hierarchical and that creates friction.", "Mark": "3.0"},
{"Caption": "Productive and Fun", "Testimonial": "Productive and Fun environment", "Mark": "4.0"},
{"Caption": "Great company to work for", "Testimonial": "The culture is just amazing and it makes you feel like you want to go at work everyday", "Mark": "4.0"},
{"Caption": "Fun workplace but really bad salary", "Testimonial": "Fun workplace but really bad salary", "Mark": "2.0"},
{"Caption": "productive and you can learn a lot about processes", "Testimonial": "Very competitive environment, poor work-life balance, a lot of micromanagement. You can learn a lot about effective processes, project management etc. alot of time assigned for project work which is great! you can learn alot here. In the team I was in there was no flexibility regarding starting and finishing time, alot of micromanagement, competition between team members rather than helping each other.", "Mark": "2.0"},
{"Caption": "Ambiente de trabajo divertido", "Testimonial": "Buen lugar para iniciar una carrera y para conocer gente", "Mark": "3.0"},
{"Caption": "fun place to work", "Testimonial": "relaxed environment to work", "Mark": "5.0"},
{"Caption": "Ambiente lavorativo stimolante e sfidante", "Testimonial": "Google è come la descrivono un ambiente informale dove viene data l'opportunità di crescere a ragazzi molto giovani. L'abiente è stimolante ma allo stesso tempo richiede molto impegno. La concorrenza è tanta e i colleghi sono molto ambiziosi.", "Mark": "4.0"},
{"Caption": "great working enviroment", "Testimonial": "great working enviroment and work stability, great managment , over all job title is great, great company to work for, makes you feel valuable and they treat you good", "Mark": "5.0"},
{"Caption": "It is one of the Great Place to work", "Testimonial": "I had been working on FTC for 6 month through recruitment agency.", "Mark": "5.0"},
{"Caption": "Great work environment", "Testimonial": "Great perks and a good learning experience for the young and old. Contractors on site (Barrow Street) are treated equally! (Offsite, East Point, not the same case!) Employees are encouraged to take breaks, which eases daily stress. Onsite gym and food made life a lot easier, but these perks also had people staying at work longer. Some don't mind this at all, as long as you're not burning yourself out! Overall, it was a wonderful experience and if there was room to move up in my field, I would have stayed.", "Mark": "4.0"},
{"Caption": "Productive and fun work place", "Testimonial": "Everything is good, job itself, atmosphere, colleagues, work conditions. But contract will expired soon and I would like more salary and wider responsibility.", "Mark": "5.0"},
{"Caption": "Great pay and perks, yet more and more corporate", "Testimonial": "Google is a great place for work - fun environment, smart and ambitious colleagues, global brand and some of the best perks of the market. Yet, I've never seem so many frustrated people around. Once you step in, you almost immediately enter the promotion race (even if that wasn't on your mind originally). And once you are in that race, you are bound to get disappointed.", "Mark": "5.0"},
{"Caption": "Long working hours, on the upside, great on your resume", "Testimonial": "I had my first job out of college here, and even though the offices are amazing, with all the perks you could ever want or expect, you work so much that this is basically no need for it, as me and most people in my team were working closer to 50-60 hours a lot of weeks than the 45 originally suggested in the contract. ", "Mark": "1.0"},
{"Caption": "Sehr gute Erfahrung", "Testimonial": "Ich war mit meiner Zeit bei Google sehr zufrieden.", "Mark": "5.0"},
{"Caption": "Focused, team orientated dynamic", "Testimonial": "Planning logistical support for Streetview Equipment in EMEA region and globally.", "Mark": "4.0"},
{"Caption": "Decent Place To Learn", "Testimonial": "Had a great time there working on the Dutch PPC team, great culture, great work/life balance. Opportunities for advancement are very achievable. Most enjoyable part of the job was hitting target. Hardest part of the job was deciding where to have lunch!", "Mark": "4.0"},
{"Caption": "Innovative, impressive and motivating work place", "Testimonial": "By far Google is one of the best places to work for, they bring equality ", "Mark": "5.0"},
{"Caption": "The perfect place to seek diversity", "Testimonial": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products, and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer.", "Mark": "4.0"}
]