[
{"Caption": "Collections Associate", "Description": "Minimum qualifications: Bachelor's degree or equivalent practical experience. Experience in consultative sales, account management, and performance solutions..."},
{"Caption": "Student Research Collaboration", "Description": "Applications for this role are now closed. Note: By applying to this position your application is automatically submitted to the following locations: London,..."},
{"Caption": "Recruiter, People Operations", "Description": "Minimum qualifications: Bachelor's degree or equivalent practical experience. Experience in a full-cycle recruiting role in an agency or corporate setting...."},
{"Caption": "Data and Analytics Analyst", "Description": "Minimum qualifications: Bachelor's degree in Engineering, Computer Science, Mathematics, Economics or Finance or equivalent practical experience. Experience..."},
{"Caption": "Investigations Analyst, Trust and Safety Ads", "Description": "Minimum qualifications: BA/BS degree or equivalent practical experience. Experience in relevant fields (Data Analysis, Research, Risk and Fraud Investigation..."},
{"Caption": "International Growth Consultant (Polish)", "Description": "Minimum qualifications: Bachelor's degree or equivalent practical experience. Ability to speak and write in English and Polish fluently and idiomatically...."},
{"Caption": "Global Business Analyst, Analytics and Insights", "Description": "Minimum qualifications: Bachelor's degree in Business, Economics or quantitative field or equivalent practical experience. Experience writing SQL queries,..."},
{"Caption": "Quantitative Business Analyst, Analytics and Insights", "Description": "Minimum qualifications: BA/BS degree with a quantitative field, or equivalent practical experience. Experience with analytics for sales or customer service..."},
{"Caption": "User Researcher, Trust and Safety", "Description": "Minimum qualifications: Bachelor's degree in Human Computer Interaction/Computer Science, Statistics, Human Factors, Psychology, related field, or equivalent..."},
{"Caption": "Associate Account Strategist, Sales, Google Customer Solutions (Norwegian)", "Description": "Minimum qualifications: Bachelor's degree or equivalent practical experience. Experience or internship in sales, customer support, account management,..."},
{"Caption": "Digital Marketing Strategist, Google Customer Solutions (English, German)", "Description": "Minimum qualifications: BA/BS degree or equivalent practical experience. Client service/account management experience. Ability to speak and write in English..."},
{"Caption": "Video Specialist, Large Customer Sales", "Description": "Minimum qualifications: Bachelor's degree in Business, a related field, or equivalent practical experience. Experience working in consultative and client..."}
]